Revit 2027 API
AssetPropertyList.InsertNewAssetPropertyInteger Method
 Insert a new AssetPropertyInteger containing the input value to this list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void InsertNewAssetPropertyInteger(
	int value,
	int index
)
Public Sub InsertNewAssetPropertyInteger (
	value As Integer,
	index As Integer
)
public:
void InsertNewAssetPropertyInteger(
	int value,
	int index
)
member InsertNewAssetPropertyInteger :
        value : int *
        index : int -> unit
Parameters
value Int32
 The integer value to insert.
index Int32
 An integer index.
Exceptions
Exception | Condition
ArgumentException |  index is out of range.
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace